Revit 2026 API

# FamilyParameterSetIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FamilyParameterSetIterator()
```
```vb
Public Sub New
```
```cpp
public:
FamilyParameterSetIterator()
```
```fsharp
new : unit -> FamilyParameterSetIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

FamilyParameterSetIterator Class

Autodesk.Revit.DB Namespace